<a href="https://colab.research.google.com/github/sajid-munawar/Data_Cleaning_with_python/blob/main/Solution_Notebook_Data_Cleaning_with_Python_Standardisation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Cleaning with Python - Standardisation

## 1. Standardisation

#### <font color="blue">Pre-requisites</font>

In [ ]:
# Pre-requisites
# ---
# Importing pandas and numpy library
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

import numpy as np

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our dataset from the url 
# ---
# 
df = pd.read_csv('http://bit.ly/SampleDataset')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Example 1a
# ---
# Renaming the column names
# ---
#
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Example 1b
# ---
# Renaming our columns, if we have many column names.
# ---
# 
df1 = pd.read_csv('http://bit.ly/SampleDataset')
df1.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# We use the str.strip(), str.lower(), str.replace() functions
# ---
df1.columns = df1.columns.str.strip().str.lower().str.replace(' ', '_')
df1.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# String conversion: Convert city column to lower case
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Converting the city column to lowercase 
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# Metric conversion: Height inches to cm
# Hint: 1 inch = 2.54 cm
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# 

df['height'] = df['height'] * 2.54
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Determining the datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [ ]:
# Performing our conversion
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Confirming our conversion
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [ ]:
# Challenge 1
# ---
# Question: Rename the columns in the following dataset.
# ---
# Dataset url = http://bit.ly/GVProjectsFunding
# ---
# OUR CODE GOES BELOW
#

# Loading our dataset 
# ---
# 
gv_df = pd.read_csv('http://bit.ly/GVProjectsFunding')
gv_df.head()

   Total_-_GOK_Budget_Est_KES  ...  OBJECTID
0                   111285239  ...         0
1                  2009277440  ...         1
2                    50034000  ...         2
3                 24267555932  ...         3
4                  1160000000  ...         4

[5 rows x 7 columns]

In [ ]:
# Renaming our columns
# ---
# 
gv_df.columns = gv_df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('_-', '_').str.replace('__', '_').str.replace('(', '').str.replace(')', '')
gv_df.head()

   total_gok_budget_est_kes  ...  objectid
0                 111285239  ...         0
1                2009277440  ...         1
2                  50034000  ...         2
3               24267555932  ...         3
4                1160000000  ...         4

[5 rows x 7 columns]

##### <font color="green">Challenge 2</font>

In [ ]:
# Challenge 2
# ---
# Question: Convert the given weight in the dataset from pounds to kgs. 
# Hint: 1 pound = 0.453592 kgs
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 
 
df['weight'] = df['weight'] * 0.453592
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="green">Challenge 3</font>

In [ ]:
# Challenge 3
# ---
# Question: Convert the variables account_a and account_b to the datatype float
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
#


df['account_a'] = df['account_a'].apply(np.float64)
df['account_b'] = df['account_b'].apply(np.float64)

# Confirming our conversion
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b        float64
total_account      int64
dtype: object